<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DisciplineSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $disciplines = [
            'МДК 09.03','Физическая культура','ОхрТруда','МДК 09.05','МДК 09.01','ОБЖ','Философия','Экономика','МДК 01.01','Промышленная безопасность','Электротехника','Родная литература','Литература','Русский язык','Математика','Астрономия','Физика','Химия','Информатика','Химия в профессиональной деятельности','Численные методы','МДК 08.01','Иностранный язык в профессиональной деятельности','Строительный отряд','МДК 01.03','МДК 01.02','МДК 02.03','МДК 11.01','МДК 02.03','МДК 04.01','Промышленная безопасность','МДК 03.01','МДК 01.06','Правила безопасности дорожного движения','МДК 01.06','Метрология, стандартизация и сертификация','МДК 01.04','МДК 02.02','МДК 02.01','Геодезия в строительстве','МДК ОргРабСтП','Психология общения','МДК 03.03','Информационные технологии в профессиональной деятельности','Доп. Основы финансовой грамотности','Экономика отрасли','Бережливое производство','Экологические основы природопользования'
        ];


        foreach ($disciplines as $discipline) {
            DB::table('disciplines')->insert([
                'title' => $discipline,
                'specialty_id' => 1,
            ]);
        }

    }
}
