<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class GroupSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $groups = [
            'АВ-221б','АМ-221б','АМ-222б','БУР-221б','БУР-222','БУХ221','ГФ-221б','ИС-221б','ИС-222б','ИС-223','МЕХ-221б','МЕХ-221б','СМ-221б','СМ-221б','СТ-222б','СТ-222б','СТ-222б','СТ-223б','ЭКС-221б','ЭКС-222','ЭКС1-223','ЭЛ-221','ЭЛ1-222б','АВ-211б','АМ-211б','АМ-212б','БУР-211б','БУР-211б','БУХ-211','ГФ-211б','ИС-211б','ИС-212б','ИС-213','МЕХ-211б','СА-211б','СМ-211б','СМ-211б','СТ-212б','СТ-213б','ЭКС-211б','ЭКС-211б','ЭКС-211б','ЭКС-211б','ЭКС-211б','ЭКС-211б','ЭКС-211б','ЭКС-211б','ЭКС-211б','ЭКС-211б','ЭКС-211б','ЭКС-211б','ЭКС-211б','ЭКС-211б','МЕХ-201б','СТ-201б','СТ-202б','СТ-203','ЭКС-201б','ЭКС-202','ЭКС1-203','ЭЛ-201','ЭЛ1-202б','ЭЛ1-202б','АД-191б','АМ-191б','АМ-192','БУР-191б','БУР-192','ГФ-191б','ИС-191б','ИС-192','МЕХ-191б','СМ-191б','СТ-191б','СТ-192б','СТ-193','ЭКС-191б','ЭКС-192','ЭКС-193','ЭКС-193'
        ];

        foreach ($groups as $group) {
            DB::table('groups')->insert([
                'title' => $group,
                'specialty_id' => 1,
            ]);
        }
    }
}
